{
    "title": "Stop Bots in Their Tracks: Introducing the TLG_JoinCaptchaBot!",
    "contentMarkdown": "\n## 📝 Quick Summary: \nTLG_JoinCaptchaBot is a Telegram bot that uses image-based CAPTCHAs to verify new users joining a group. It automatically sends a CAPTCHA to each new member and removes those who fail to solve it within a specified time. Additionally, it prevents spam by deleting messages containing URLs sent by unverified users.\n\n## 🔑 Key Takeaways\n\n- ✅ Protects Telegram groups from bots and spammers.\n\n- ✅ Uses image-based CAPTCHAs for effective human verification.\n\n- ✅ Easy installation and configuration with a well-structured codebase.\n\n- ✅ Includes features to detect and delete spam messages from new users.\n\n- ✅ Flexible settings allow customization for different group needs and sizes\n\n\n## 📊 Project Statistics\n- ⭐ Stars: 557\n- 🍴 Forks: 229\n- ❗ Open Issues: 13\n\n\n## 🛠 Tech Stack\n- ✅ Python\n\n\nTired of bots flooding your Telegram group?  Meet TLG_JoinCaptchaBot, the superhero your group chat needs! This awesome GitHub project tackles the annoying problem of unwanted bots and spammers joining your Telegram groups.  It does this by cleverly implementing a CAPTCHA system that new members must solve before they can fully participate.\n\nThe bot's functionality is surprisingly straightforward. When a new user joins the group, the bot automatically sends them a simple image-based CAPTCHA. This isn't your typical text-based CAPTCHA; it's an image with slightly distorted text, making it difficult for automated bots to crack.  The user has a limited time to solve the CAPTCHA and prove they're human.  If they succeed, they're in! If they fail or take too long, the bot politely removes them from the group, keeping your community safe from spam.\n\nBut that's not all!  The bot also actively scans for spammy behavior. Any new member who tries to share a link before solving the CAPTCHA will have their message deleted. This double-layered defense mechanism ensures that malicious actors have a much harder time infiltrating your group.\n\nThe architecture is surprisingly clean and efficient.  It uses the `multicolor_captcha_generator` library (also available on GitHub!) to create the CAPTCHAs, ensuring a consistent and visually appealing challenge. The bot itself is written in Python and leverages Telegram's Bot API for seamless integration.  The configuration is super flexible, allowing you to adjust the CAPTCHA difficulty, time limits, and other settings to perfectly suit your group's needs.  Everything is neatly managed through a simple JSON configuration file, making it easy to tweak the bot's behavior without diving into the code.\n\nAs a developer, you'll appreciate the well-structured codebase and comprehensive documentation. The project is designed for easy installation and setup, with clear instructions and a helpful Makefile to streamline common tasks. You can even run it as a systemd service for seamless integration into your server's infrastructure or use Docker for easy deployment and portability.\n\nWhat are the benefits?  Think of the time saved by not having to manually remove bots and spammers!  Imagine the improved group experience with fewer unwanted messages and a more engaged community. This bot gives you peace of mind, knowing your group is protected from unwanted intrusions.  It's like having a dedicated security guard for your Telegram group, working tirelessly in the background to maintain order and keep the bad guys out!\n\nIf you're a developer looking for a fun project to explore, a practical tool to improve your Telegram groups, or a way to learn more about bot development and CAPTCHA implementation, you absolutely need to check out TLG_JoinCaptchaBot.  It's a fantastic example of a well-designed, practical, and easily deployable project.\n\n## 📚 Learn More\n[View the Project on GitHub](https://github.com/J-Rios/TLG_JoinCaptchaBot)\n\n---\n\nEnjoyed this project? Get a daily dose of awesome open-source discoveries by following [GitHub Open Source](https://t.me/GitHub_Open_Source) on Telegram! 🎉\n",
    "tags": [
        {
            "name": "telegram",
            "slug": "telegram"
        },
        {
            "name": "bot",
            "slug": "bot"
        },
        {
            "name": "python",
            "slug": "python"
        },
        {
            "name": "captcha",
            "slug": "captcha"
        },
        {
            "name": "anti-spam",
            "slug": "anti-spam"
        }
    ],
    "slug": "stop-bots-in-their-tracks-introducing-the-tlgjoincaptchabot",
    "project_id": 148061471,
    "coverImage": "",
    "isNewsletterActivated": false,
    "isRepublished": false
}